JuiceBeMyName/STM32-Projects/drivers/Src/stm32l47xxx_usart_driver.c
#include "stm32l47xxx_usart_driver.h"

/*********************************************************************
 * @fn      		- USART_PeriClockControl
 *
 * @brief           - Enables or disables the peripheral clock for the given USART port
 *
 * @param[in]		- pUSARTx: Base address of the USART peripheral (e.g., USART1, USART2)
 * @param[in]		- EnorDi: ENABLE or DISABLE macro
 *
 * @return			- none
 *
 * @note			- USART1 is on the APB2 bus. USART2 and USART3 are on the APB1 bus.
 *********************************************************************/
void USART_PeriClockControl(USART_RegDef_t *pUSARTx, uint8_t EnorDi)
{
	if (EnorDi == ENABLE)
	{
		if (pUSARTx == USART1)
		{
			USART1_PCLK_EN();
		}
		else if (pUSARTx == USART2)
		{
			USART2_PCLK_EN();
		}
		else if (pUSARTx == USART3)
		{
			USART3_PCLK_EN();
		}
	}
	else
	{
		if (pUSARTx == USART1)
		{
			USART1_PCLK_DI();
		}
		else if (pUSARTx == USART2)
		{
			USART2_PCLK_DI();
		}
		else if (pUSARTx == USART3)
		{
			USART3_PCLK_DI();
		}
	}
}



/*********************************************************************
 * @fn      		- USART_Init
 *
 * @brief           - Initializes the USART peripheral based on the handle configuration
 *
 * @param[in]		- pUSARTHandle: Pointer to the USART handle structure
 *
 * @return			- none
 *********************************************************************/
void USART_Init(USART_Handle_t *pUSARTHandle)
{
	// Temporary register to hold our settings before we drop them into the hardware
	uint32_t tempreg = 0;

	// 1. Enable the Peripheral Clock for this specific USART
	USART_PeriClockControl(pUSARTHandle->pUSARTx, ENABLE);

	// ==========================================================
	// CONFIGURATION OF CR1 (Mode, Word Length, Parity)
	// ==========================================================

	// 1. Enable USART TX and RX engines according to the USART_Mode configuration item
	if (pUSARTHandle->USART_Config.USART_Mode == USART_MODE_ONLY_RX)
	{
		// The code to enable the Receiver bit field
		tempreg |= (1 << USART_CR1_RE);


	}
	else if (pUSARTHandle->USART_Config.USART_Mode == USART_MODE_ONLY_TX)
	{
		// The code to enable the Transmitter bit field
		tempreg |= (1 << USART_CR1_TE);
	}
	else if (pUSARTHandle->USART_Config.USART_Mode == USART_MODE_TXRX)
	{
		// The code to enable the both Transmitter and Receiver bit fields
		tempreg |= ((1 << USART_CR1_RE) | (1 << USART_CR1_TE));
	}

	// 2. Configure the Word Length (M0 is Bit 12, M1 is Bit 28)
	// M[1:0] literally just means: [ M1 , M0 ]
	if (pUSARTHandle->USART_Config.USART_WordLength == USART_WORDLEN_8BITS)
	{
		tempreg &= ~(1 << USART_CR1_M0);
		tempreg &= ~(1 << USART_CR1_M1);
	}
	else if (pUSARTHandle->USART_Config.USART_WordLength == USART_WORDLEN_9BITS)
	{
		tempreg |= (1 << USART_CR1_M0);
		tempreg &= ~(1 << USART_CR1_M1);
	}
	else if (pUSARTHandle->USART_Config.USART_WordLength == USART_WORDLEN_7BITS)
	{
		tempreg &= ~(1 << USART_CR1_M0);
		tempreg |= (1 << USART_CR1_M1);
	}

	// 3. Configure Parity Control
	if (pUSARTHandle->USART_Config.USART_ParityControl == USART_PARITY_EN_EVEN)
	{
		// Enable Parity Control (PCE) and keep Parity Selection (PS) at 0 for EVEN
		tempreg |= (1 << USART_CR1_PCE);
		tempreg &= ~(1 << USART_CR1_PS);
	}
	else if (pUSARTHandle->USART_Config.USART_ParityControl == USART_PARITY_EN_ODD)
	{
		// Enable Parity Control (PCE) and set Parity Selection (PS) to 1 for ODD
		tempreg |= (1 << USART_CR1_PCE);
		tempreg |= (1 << USART_CR1_PS);
	}

	// 4. Configure Oversampling Mode
	if (pUSARTHandle->USART_Config.USART_Oversampling == USART_OVERSAMPLING_8)
	{
		tempreg |= (1 << USART_CR1_OVER8);
	}
	else
	{
		tempreg &= ~(1 << USART_CR1_OVER8);
	}

	// Write all into CR1
	pUSARTHandle->pUSARTx->CR1 = tempreg;

	// ==========================================================
	// CONFIGURATION OF CR2 (Stop Bits)
	// ==========================================================
	tempreg = 0; 	// Reset tempreg for CR2

	// Program the number of stop bits into the STOP bits field of CR2
	tempreg |= (pUSARTHandle->USART_Config.USART_NoOfStopBits << USART_CR2_STOP);

	// Write it into CR2
	pUSARTHandle->pUSARTx->CR2 = tempreg;

	// ==========================================================
	// CONFIGURATION OF CR3 (Hardware Flow Control)
	// ==========================================================
	tempreg = 0;	// Reset tempreg for CR3

	if (pUSARTHandle->USART_Config.USART_HWFlowControl == USART_HW_FLOW_CTRL_CTS)
	{
		// CTS - clear to send. If CTS is LOW other device is ready if HIGH then busy/full
		tempreg |= (1 << USART_CR3_CTSE);
	}
	else if (pUSARTHandle->USART_Config.USART_HWFlowControl == USART_HW_FLOW_CTRL_RTS)
	{
		// RTS - request to send ("I am ready to receive"). RTS is pulled LOW if it's full then RTS is pulled HIGH
		tempreg |= (1 << USART_CR3_RTSE);
	}
	else if (pUSARTHandle->USART_Config.USART_HWFlowControl == USART_HW_FLOW_CTRL_CTS_RTS)
	{
		tempreg |= (1 << USART_CR3_CTSE);
		tempreg |= (1 << USART_CR3_RTSE);
	}

	// Write all to CR3
	pUSARTHandle->pUSARTx->CR3 = tempreg;


	// ==========================================================
	// CONFIGURATION OF BRR (Baud Rate)
	// ==========================================================
	// Function to do the math and drop it into the BRR register
	USART_SetBaudRate(pUSARTHandle->pUSARTx, pUSARTHandle->USART_Config.USART_Baud);
}



/*********************************************************************
 * @fn      		- USART_DeInit
 *
 * @brief           - Resets the USART peripheral back to its factory default state
 *
 * @param[in]		- pUSARTx: Base address of the USART peripheral to reset
 *
 * @return			- none
 *********************************************************************/
void USART_DeInit(USART_RegDef_t *pUSARTx)
{
	if (pUSARTx == USART1)
	{
		RCC->APB2RSTR |= (1 << 14);  // Force reset
		RCC->APB2RSTR &= ~(1 << 14); // Release reset
	}
	else if (pUSARTx == USART2)
	{
		RCC->APB1RSTR1 |= (1 << 17);
		RCC->APB1RSTR1 &= ~(1 << 17);
	}
	else if (pUSARTx == USART3)
	{
		RCC->APB1RSTR1 |= (1 << 18);
		RCC->APB1RSTR1 &= ~(1 << 18);
	}
}



/*********************************************************************
 * @fn      		- USART_SetBaudRate
 *
 * @brief           - Calculates and configures the Baud Rate register (BRR)
 *
 * @param[in]		- pUSARTx: Base address of the USART peripheral
 * @param[in]		- BaudRate: The desired baud rate (e.g., 9600, 115200)
 *
 * @return			- none
 *********************************************************************/
void USART_SetBaudRate(USART_RegDef_t *pUSARTx, uint32_t BaudRate)
{
	uint32_t PCLKx;
	uint32_t usartdiv;
	uint32_t tempreg = 0;

	// 1. Find the Peripheral Clock Frequency dynamically!
	if (pUSARTx == USART1)
	{
		// USART1 is on the fast APB2 bus
		PCLKx = RCC_GetPCLK2Value();
	}
	else
	{
		// USART2, USART3, UART4, UART5 are on the APB1 bus
		PCLKx = RCC_GetPCLK1Value();
	}

	// 2. Check if the user turned ON Oversampling by 8 (OVER8 bit in CR1)
	if (pUSARTx->CR1 & (1 << USART_CR1_OVER8))
	{
		// --- OVER8 = 1 (Oversampling by 8) ---
		// The math formula requires multiplying the clock by 2
		usartdiv = ((2 * PCLKx) + (BaudRate / 2)) / BaudRate;

		// The STM32 hardware requires a strange bit-shift for the bottom 4 bits in OVER8 mode
		tempreg = ((usartdiv & 0xFFF0) | ((usartdiv & 0x000F) >> 1));
		pUSARTx->BRR = tempreg;
	}
	else
	{
		// --- OVER8 = 0 (Oversampling by 16) ---
		// This is the standard, clean math you already wrote!
		usartdiv = (PCLKx + (BaudRate / 2)) / BaudRate;
		pUSARTx->BRR = usartdiv;
	}
}



/*********************************************************************
 * @fn      		- USART_GetFlagStatus
 *
 * @brief           - Checks whether a specific USART flag is set or not
 *
 * @param[in]		- pUSARTx: Base address of the USART peripheral
 * @param[in]		- FlagName: The macro of the flag to check (e.g., USART_FLAG_TXE)
 *
 * @return			- uint8_t: SET (1) or RESET (0)
 *********************************************************************/
uint8_t USART_GetFlagStatus(USART_RegDef_t *pUSARTx, uint32_t FlagName)
{
	if (pUSARTx->ISR & FlagName)
	{
		return SET;
	}

