JuiceBeMyName/STM32-Projects/drivers/Src/stm32l47xxx_usart_driver.c
	return RESET;
}



/*********************************************************************
 * @fn      		- USART_SendData
 *
 * @brief           - Blocks the CPU and transmits data over the TX pin
 *
 * @param[in]		- pUSARTx: Base address of the USART peripheral
 * @param[in]		- pTxBuffer: Pointer to the data payload you want to send
 * @param[in]		- Len: Number of bytes to send
 *
 * @return			- none
 *********************************************************************/
void USART_SendData(USART_RegDef_t *pUSARTx, uint8_t *pTxBuffer, uint32_t Len)
{
	uint16_t *pdata;

	// Loop over the length of the data
	for (uint32_t i = 0; i < Len; i++)
	{
		// 1. Wait until TXE (Transmit Data Register Empty) flag is set
		// This traps the CPU here until the hardware is ready for the next byte
		while (USART_GetFlagStatus(pUSARTx, USART_FLAG_TXE) == RESET);

		// 2. Check the Word Length configuration
		// Extract the M0 and M1 bits from CR1 to see how we should package the data
		uint8_t val_M0 = (pUSARTx->CR1 >> USART_CR1_M0) & 0x1;
		uint8_t val_M1 = (pUSARTx->CR1 >> USART_CR1_M1) & 0x1;

		if (val_M0 == 1 && val_M1 == 0)
		{
			// --- 9-BIT MODE ---
			pdata = (uint16_t*) pTxBuffer;

			// Load exactly 9 bits of data into the TDR register
			pUSARTx->TDR = (*pdata & (uint16_t)0x01FF);

			// Check if Parity Control is enabled (PCE bit in CR1)
			if ((pUSARTx->CR1 >> USART_CR1_PCE) & 0x1)
			{
				// Parity is ON: Hardware automatically generates the 9th bit.
				// We only sent 8 bits of actual user data, so move buffer by 1 byte
				pTxBuffer++;
			}
			else
			{
				// Parity is OFF: All 9 bits are user data!
				// 9 bits take up two bytes of our buffer, so move buffer by 2 bytes
				pTxBuffer++;
				pTxBuffer++;
				i++; // We consumed an extra byte of 'Len', so increment our loop counter
			}

		}
		else
		{
			// --- 8-BIT OR 7-BIT MODE ---
			// We just drop standard 8-bit bytes into the TDR register
			pUSARTx->TDR = (*pTxBuffer & (uint8_t)0xFF);

			// Move buffer pointer forward by 1 byte
			pTxBuffer++;
		}
	}

	// 3. Wait for TC (Transmission Complete) flag to be set
	// This ensures the very last byte has completely left the shift register
	// before the function finishes and returns control to main.c
	while (USART_GetFlagStatus(pUSARTx, USART_FLAG_TC) == RESET);
}



/*********************************************************************
 * @fn      		- USART_ReceiveData
 *
 * @brief           - Blocks the CPU and receives data from the RX pin
 *
 * @param[in]		- pUSARTx: Base address of the USART peripheral
 * @param[in]		- pRxBuffer: Pointer to the memory where received data will be stored
 * @param[in]		- Len: Number of bytes to receive
 *
 * @return			- none
 *********************************************************************/
void USART_ReceiveData(USART_RegDef_t *pUSARTx, uint8_t *pRxBuffer, uint32_t Len)
{
	// Loop over the length of the data we expect to receive
	for (uint32_t i = 0; i < Len; i++)
	{
		// 1. Wait until RXNE (Receive Data Register Not Empty) flag is set
		// This traps the CPU here until the hardware confirms a new byte has arrived!
		while (USART_GetFlagStatus(pUSARTx, USART_FLAG_RXNE) == RESET);

		// 2. Check the Word Length configuration
		// Extract the M0 and M1 bits from CR1 to see how we should read the data
		uint8_t val_M0 = (pUSARTx->CR1 >> USART_CR1_M0) & 0x1;
		uint8_t val_M1 = (pUSARTx->CR1 >> USART_CR1_M1) & 0x1;

		if (val_M0 == 1 && val_M1 == 0)
		{
			// --- 9-BIT MODE ---
			// Check if Parity Control is enabled (PCE bit)
			if ((pUSARTx->CR1 >> USART_CR1_PCE) & 0x1)
			{
				// Parity is ON: The 9th bit is a parity bit we don't want
				// We only read the first 8 bits of actual user data
				*pRxBuffer = (pUSARTx->RDR & (uint8_t)0xFF);
				pRxBuffer++;
			}
			else
			{
				// Parity is OFF: All 9 bits are valid user data!
				// 9 bits require two bytes of memory space, so we cast to a 16-bit pointer
				*((uint16_t*) pRxBuffer) = (pUSARTx->RDR & (uint16_t)0x01FF);
				pRxBuffer++;
				pRxBuffer++;
				i++; // We filled two bytes of the user's length request, so increment loop
			}
		}
		else
		{
			// --- 8-BIT OR 7-BIT MODE ---
			// Check if Parity Control is enabled
			if ((pUSARTx->CR1 >> USART_CR1_PCE) & 0x1)
			{
				// Parity is ON: The 8th bit is parity. We only want 7 bits of user data.
				// 0x7F in binary is 0111 1111 (Perfect mask to grab only 7 bits)
				*pRxBuffer = (pUSARTx->RDR & (uint8_t)0x7F);
				pRxBuffer++;
			}
			else
			{
				// Parity is OFF: All 8 bits are valid user data!
				// 0xFF in binary is 1111 1111
				*pRxBuffer = (pUSARTx->RDR & (uint8_t)0xFF);
				pRxBuffer++;
			}
		}
	}
}



/*********************************************************************
 * @fn      		- USART_PeripheralControl
 *
 * @brief           - Enables or disables the USART peripheral engine
 *
 * @param[in]		- pUSARTx: Base address of the USART peripheral
 * @param[in]		- EnOrDi: ENABLE or DISABLE macro
 *
 * @return			- none
 *********************************************************************/
void USART_PeripheralControl(USART_RegDef_t *pUSARTx, uint8_t EnOrDi)
{
	if (EnOrDi == ENABLE)
	{
		// Turn the USART ON by setting the UE (USART Enable) bit to 1
		pUSARTx->CR1 |= (1 << USART_CR1_UE);
	}
	else
	{
		// Turn the USART OFF by clearing the UE bit to 0
		pUSARTx->CR1 &= ~(1 << USART_CR1_UE);
	}
}



/*********************************************************************
 * @fn      		- USART_SendDataIT
 *
 * @brief           - Initiates a non-blocking transmission using Interrupts
 *
 * @param[in]		- pUSARTHandle: Pointer to the USART handle structure
 * @param[in]		- pTxBuffer: Pointer to the data payload you want to send
 * @param[in]		- Len: Number of bytes to send
 *
 * @return			- uint8_t: Returns the current state (USART_READY or USART_BUSY_IN_TX)
 *********************************************************************/
uint8_t USART_SendDataIT(USART_Handle_t *pUSARTHandle, uint8_t *pTxBuffer, uint32_t Len)
{
	uint8_t txstate = pUSARTHandle->TxBusyState;

	if (txstate != USART_BUSY_IN_TX)
	{
		// 1. Save the Tx buffer address and length information in the handle
		pUSARTHandle->pTxBuffer = pTxBuffer;
		pUSARTHandle->TxLen = Len;

		// 2. Update the USART state to BUSY
		pUSARTHandle->TxBusyState = USART_BUSY_IN_TX;

		// 3. Enable the TXEIE (Transmit Data Register Empty Interrupt Enable) bit
		// This tells the hardware to generate an interrupt whenever TXE becomes 1
		pUSARTHandle->pUSARTx->CR1 |= (1 << USART_CR1_TXEIE);

