JuiceBeMyName/STM32-Projects/drivers/Src/stm32l47xxx_usart_driver.c
		// 4. Enable the TCIE (Transmission Complete Interrupt Enable) bit
		pUSARTHandle->pUSARTx->CR1 |= (1 << USART_CR1_TCIE);
	}

	return txstate;
}



/*********************************************************************
 * @fn      		- USART_ReceiveDataIT
 *
 * @brief           - Initiates a non-blocking reception using Interrupts
 *
 * @param[in]		- pUSARTHandle: Pointer to the USART handle structure
 * @param[in]		- pRxBuffer: Pointer to the memory where received data will be stored
 * @param[in]		- Len: Number of bytes to receive
 *
 * @return			- uint8_t: Returns the current state (USART_READY or USART_BUSY_IN_RX)
 *********************************************************************/
uint8_t USART_ReceiveDataIT(USART_Handle_t *pUSARTHandle, uint8_t *pRxBuffer, uint32_t Len)
{
	uint8_t rxstate = pUSARTHandle->RxBusyState;

	if (rxstate != USART_BUSY_IN_RX)
	{
		// 1. Save the Rx buffer address and length information in the handle
		pUSARTHandle->pRxBuffer = pRxBuffer;
		pUSARTHandle->RxLen = Len;

		// 2. Update the USART state to BUSY
		pUSARTHandle->RxBusyState = USART_BUSY_IN_RX;

		// 3. Enable the RXNEIE (Receive Data Register Not Empty Interrupt Enable) bit
		// This tells the hardware to generate an interrupt whenever a new byte arrives
		pUSARTHandle->pUSARTx->CR1 |= (1 << USART_CR1_RXNEIE);
	}

	return rxstate;
}



/*********************************************************************
 * @fn      		- USART_IRQHandling
 *
 * @brief           - Handles the background data transfer when an interrupt is triggered
 *
 * @param[in]		- pUSARTHandle: Pointer to the USART handle structure
 *
 * @return			- none
 *********************************************************************/
void USART_IRQHandling(USART_Handle_t *pUSARTHandle)
{
	uint32_t temp1, temp2;
	uint16_t *pdata;

	// ==========================================================
	// 1. Handle TXE (Transmit Data Register Empty) Interrupt
	// ==========================================================
	// Check if the TXE flag is set in the ISR register
	temp1 = pUSARTHandle->pUSARTx->ISR & (1 << USART_ISR_TXE);
	// Check if the TXE interrupt was actually enabled in the CR1 register
	temp2 = pUSARTHandle->pUSARTx->CR1 & (1 << USART_CR1_TXEIE);

	if (temp1 && temp2)
	{
		// We are here because the TDR is empty! Let's check if we actually have data to send
		if (pUSARTHandle->TxBusyState == USART_BUSY_IN_TX)
		{
			// Keep sending data as long as TxLen is greater than 0
			if (pUSARTHandle->TxLen > 0)
			{
				// Check the Word Length (M0 and M1 bits)
				uint8_t val_M0 = (pUSARTHandle->pUSARTx->CR1 >> USART_CR1_M0) & 0x1;
				uint8_t val_M1 = (pUSARTHandle->pUSARTx->CR1 >> USART_CR1_M1) & 0x1;

				if (val_M0 == 1 && val_M1 == 0)
				{
					// --- 9-BIT MODE ---
					pdata = (uint16_t *) pUSARTHandle->pTxBuffer;
					pUSARTHandle->pUSARTx->TDR = (*pdata & (uint16_t)0x01FF);

					if ((pUSARTHandle->pUSARTx->CR1 >> USART_CR1_PCE) & 0x1)
					{
						// Parity ON
						pUSARTHandle->pTxBuffer++;
						pUSARTHandle->TxLen--;
					}
					else
					{
						// Parity OFF
						pUSARTHandle->pTxBuffer++;
						pUSARTHandle->pTxBuffer++;
						pUSARTHandle->TxLen -= 2;
					}
				}
				else
				{
					// --- 8-BIT OR 7-BIT MODE ---
					pUSARTHandle->pUSARTx->TDR = (*(pUSARTHandle->pTxBuffer) & (uint8_t)0xFF);
					pUSARTHandle->pTxBuffer++;
					pUSARTHandle->TxLen--;
				}
			}

			// Check if that was the very last byte
			if (pUSARTHandle->TxLen == 0)
			{
				// We have loaded the final byte into the TDR.
				// Turn OFF the TXE doorbell so it doesn't trap the CPU in an endless loop
				pUSARTHandle->pUSARTx->CR1 &= ~(1 << USART_CR1_TXEIE);
			}
		}
	}

	// ==========================================================
	// 2. Handle TC (Transmission Complete) Interrupt
	// ==========================================================
	temp1 = pUSARTHandle->pUSARTx->ISR & (1 << USART_ISR_TC);
	temp2 = pUSARTHandle->pUSARTx->CR1 & (1 << USART_CR1_TCIE);

	if (temp1 && temp2)
	{
		// We are here because the very last bit has physically left the pin
		if (pUSARTHandle->TxBusyState == USART_BUSY_IN_TX)
		{
			// 1. Turn OFF the TC doorbell
			pUSARTHandle->pUSARTx->CR1 &= ~(1 << USART_CR1_TCIE);

			// 2. Reset the application state so it can accept a new message later
			pUSARTHandle->TxBusyState = USART_READY;

			// 3. Reset the buffer pointers and length to be safe
			pUSARTHandle->pTxBuffer = NULL;
			pUSARTHandle->TxLen = 0;

			// 4. Call the application callback to let main.c know the transmission is 100% finished
			USART_ApplicationEventCallback(pUSARTHandle, USART_EVENT_TX_CMPLT /* USART_EVENT_TX_CMPLT */);
		}
	}

	// ==========================================================
	// 3. Handle RXNE (Receive Data Register Not Empty) Interrupt
	// ==========================================================
	temp1 = pUSARTHandle->pUSARTx->ISR & (1 << USART_ISR_RXNE);
	temp2 = pUSARTHandle->pUSARTx->CR1 & (1 << USART_CR1_RXNEIE);

	if (temp1 && temp2)
	{
		// We are here because a new byte just arrived from the wire
		if (pUSARTHandle->RxBusyState == USART_BUSY_IN_RX)
		{
			if (pUSARTHandle->RxLen > 0)
			{
				uint8_t val_M0 = (pUSARTHandle->pUSARTx->CR1 >> USART_CR1_M0) & 0x1;
				uint8_t val_M1 = (pUSARTHandle->pUSARTx->CR1 >> USART_CR1_M1) & 0x1;

				if (val_M0 == 1 && val_M1 == 0)
				{
					// --- 9-BIT MODE ---
					if ((pUSARTHandle->pUSARTx->CR1 >> USART_CR1_PCE) & 0x1)
					{
						// Parity ON
						// Apply the & 0xFF mask to wipe out any garbage and guarantee we only have 8 clean bits
						// We dereference so compiler says "Okay, go to that address, open the 8-bit box, and get ready to drop data inside"
						*((uint8_t*) pUSARTHandle->pRxBuffer) = (pUSARTHandle->pUSARTx->RDR & (uint8_t)0xFF);
						pUSARTHandle->pRxBuffer++;
						pUSARTHandle->RxLen--;
					}
					else
					{
						// Parity OFF
						*((uint16_t *) pUSARTHandle->pRxBuffer) = (pUSARTHandle->pUSARTx->RDR & (uint16_t)0x01FF);
						pUSARTHandle->pRxBuffer += 2;
						pUSARTHandle->RxLen -= 2;
					}
				}
				else
				{
					// --- 8-BIT OR 7-BIT MODE ---
					if ((pUSARTHandle->pUSARTx->CR1 >> USART_CR1_PCE) & 0x1)
					{
						// Parity ON
						*((uint8_t*) pUSARTHandle->pRxBuffer) = (pUSARTHandle->pUSARTx->RDR & (uint8_t)0x7F);
						pUSARTHandle->pRxBuffer++;
						pUSARTHandle->RxLen--;
					}
					else
					{
						// Parity OFF
						*((uint8_t*) pUSARTHandle->pRxBuffer) = (pUSARTHandle->pUSARTx->RDR & (uint8_t)0xFF);
						pUSARTHandle->pRxBuffer++;
						pUSARTHandle->RxLen--;
					}
				}
			}

			// Check if we have received all the requested bytes
			if (pUSARTHandle->RxLen == 0)
			{
				// 1. Turn OFF the RXNE doorbell
				pUSARTHandle->pUSARTx->CR1 &= ~(1 << USART_CR1_RXNEIE);

				// 2. Reset the application state
				pUSARTHandle->RxBusyState = USART_READY;

				// 3. Call the application callback to tell main.c we got all the data
				USART_ApplicationEventCallback(pUSARTHandle, USART_EVENT_RX_CMPLT /* USART_EVENT_RX_CMPLT */);
			}
		}
	}
}



/*********************************************************************
 * @fn      		- USART_IRQInterruptConfig
 *
 * @brief           - Configures the NVIC (ARM Cortex Processor) to enable or disable interrupts
 *
 * @param[in]		- IRQNumber: The IRQ number of the USART (e.g., 37 for USART1, 38 for USART2)
 * @param[in]		- EnorDi: ENABLE or DISABLE
 *
 * @return			- none
 *********************************************************************/
void USART_IRQInterruptConfig(uint8_t IRQNumber, uint8_t EnorDi)
{
	if (EnorDi == ENABLE)
	{
		if (IRQNumber <= 31)
		{
			// Program ISER0 register (IRQs 0 to 31)
			*NVIC_ISER0 |= (1 << IRQNumber);
		}
		else if (IRQNumber > 31 && IRQNumber < 64)
		{
			// Program ISER1 register (IRQs 32 to 63)
			*NVIC_ISER1 |= (1 << (IRQNumber % 32));
		}
		else if (IRQNumber >= 64 && IRQNumber < 96)
		{
			// Program ISER2 register (IRQs 64 to 95)
			*NVIC_ISER2 |= (1 << (IRQNumber % 32));
		}
	}
	else
	{
		if (IRQNumber <= 31)
		{
			// Program ICER0 register (IRQs 0 to 31)
			*NVIC_ICER0 |= (1 << IRQNumber);
		}
		else if (IRQNumber > 31 && IRQNumber < 64)
		{
			// Program ICER1 register (IRQs 32 to 63)
			*NVIC_ICER1 |= (1 << (IRQNumber % 32));
		}
		else if (IRQNumber >= 64 && IRQNumber < 96)
		{
			// Program ICER2 register (IRQs 64 to 95)
			*NVIC_ICER2 |= (1 << (IRQNumber % 32));
		}
	}
}



/*********************************************************************
 * @fn      		- USART_IRQPriorityConfig
 *
 * @brief           - Configures the priority of the given IRQ number in the NVIC
 *
 * @param[in]		- IRQNumber: The IRQ number
 * @param[in]		- IRQPriority: The priority value (0 to 15, lower number = higher priority)
 *
 * @return			- none
 *********************************************************************/
void USART_IRQPriorityConfig(uint8_t IRQNumber, uint32_t IRQPriority)
{
	// 1. Find the corresponding IPR (Interrupt Priority Register)
	// Each register holds 4 priorities, so divide by 4 to find the correct register index
	uint8_t iprx = IRQNumber / 4;

