JuiceBeMyName/STM32-Projects/drivers/Src/stm32l47xxx_usart_driver.c
	// 2. Find the exact 8-bit section inside that register
	uint8_t iprx_section = IRQNumber % 4;

	// 3. Calculate the shift amount
	// STM32 microcontroller only implements the upper 4 bits of each 8-bit section
	uint8_t shift_amount = (8 * iprx_section) + (8 - NO_PR_BITS_IMPLEMENTED);

	// 4. Apply the priority to the correct register
	*(NVIC_PR_BASE_ADDR + iprx) |= (IRQPriority << shift_amount);
}



/*********************************************************************
 * @fn      		- USART_ClearFlag
 *
 * @brief           - Clears a specific flag in the USART peripheral
 *
 * @param[in]		- pUSARTx: Base address of the USART peripheral
 * @param[in]		- StatusFlagName: The macro of the flag to clear
 *
 * @return			- none
 *********************************************************************/
void USART_ClearFlag(USART_RegDef_t *pUSARTx, uint16_t StatusFlagName)
{
	// Direct assignment is faster and safer for the ICR register.
	// Writing a 0 has no effect, so it won't accidentally clear other flags.
	pUSARTx->ICR = StatusFlagName;
}



/*********************************************************************
 * @fn      		- USART_InterruptControl
 *
 * @brief           - Enables or Disables specific USART hardware interrupts
 *
 * @param[in]		- pUSARTx: Pointer to the USART peripheral register definition structure
 * @param[in]		- interrupt_type: The specific interrupt bit to configure (e.g., USART_IT_RXNE)
 * @param[in]		- EnOrDi: ENABLE or DISABLE macro
 *
 * @return			- None
 *
 * @note			- Modifies the CR1 register to enable/disable hardware interrupt generation.
 * Ensure NVIC is also enabled in the application layer.
 *********************************************************************/
void USART_InterruptControl(USART_RegDef_t *pUSARTx, uint8_t interrupt_type, uint8_t EnOrDi)
{
	if (EnOrDi == ENABLE)
	{
		// Turn ON the specific interrupt bit
		pUSARTx->CR1 |= (1 << interrupt_type);
	}
	else
	{
		// Turn OFF the specific interrupt bit
		pUSARTx->CR1 &= ~(1 << interrupt_type);
	}
}



/*********************************************************************
 * @fn      		- USART_ApplicationEventCallback
 *
 * @brief           - Application callback function for USART events
 *
 * @param[in]		- pUSARTHandle: Pointer to the USART handle structure
 * @param[in]		- AppEv: The event macro that triggered the callback
 *
 * @return			- none
 * * @note          - This is a __weak function. The application should
 * override this to implement custom event handling.
 *********************************************************************/
__weak void USART_ApplicationEventCallback(USART_Handle_t *pUSARTHandle, uint8_t AppEv)
{
	// This is a weak implementation. The application (main.c) may override this.
	// If the user doesn't write their own version in main.c, this empty one runs safely.
}
